# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [ ]:
import mysql.connector as sqlcon

### Connect to DB using Mysql-connector-python package

In [1]:
connection = sqlcon.connect(host= "localhost", user = "root", passwd = "root123")

### You are required to create a database named 'e_commerce'

In [4]:
query = "create database ecommerce"
cursor1 = connection.cursor()
cursor1.execute(query)
connection.commit()
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [5]:
connection = sqlcon.connect(host= "localhost", user = "root", passwd = "root123", database ="ecommerce")
q1 = "create table customer(cus_id int auto_increment primary key, cus_name varchar(50) null default null, cus_phone bigint, cus_city varchar(50), cus_gender char"
q2= "create table supplier(supp_id int auto_increment primary key, supp_name varchar(50), supp_city varchar(50), supp_phone bigint)"
q3= "create table category(cat_id int auto_increment primary key, cat_name varchar(50))"
q4= "create table product(pro_id int auto_increment primary key, pro_name varchar(50) null default null, pro_desc varchar(50) null default null, cat_id int not null, foreign key (cat_id) references category(cat_id))"
q5= "create table productdetails(prod_id int auto_increment primary key not null, pro_id int not null, supp_id int not null, price float not null,FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))"
q6= "create table orders(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))"
q7= "create table rating(rat_id int primary key auto_increment, cus_id int not null, supp_id int not null, rat_ratstars int not null, foreign key(cus_id) references customer(cus_id), foreign key(supp_id) references supplier(supp_id))"

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [ ]:
val= [(1,"Rajesh Retails", "Delhi",1234567890),(2, "Appario Ltd", "Mumbai", 258963147032),(3, "Knome products", "Bangalore", 9785462315), (4, "Bansal Retails", "Kochi", 8975463285),(5,"Mittal Ltd.", "Lucknow", 78984456532)]
insert_supp_details= """insert into supplier(supp_id, supp_name, supp_city, supp_phone) values(%s,%s,%s,%s)"""
cursor1.executemany(insert_supp_details,val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [ ]:
val = [(1,"Aakash", 9999999999, "DELHI", "M"), (2, "AMAN", 9785463215,"NOIDA", "M"), (3, "NEHA", 99999999998,"MUMBAI", "F"), (4, "MEGHA", 9994562399, "KOLKATA", "F"),(5, "PULKIT", 7895999999, "LUCKNOW", "M")]
insert_cust_details= """insert into customer values(%s,%s,%s,%s,%s)"""
cursor1.executemany(insert_cust_details,val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [ ]:
insert_category_details= """insert into category values(%s,%s)"""
val= [(1, "BOOKS"), (2, "GAMES"), (3, "GROCERIES"), (4, "ELECTRONICS"), (5, "CLOTHES")]
cursor1.executemany(insert_category_details,val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [ ]:
insert_prod_details="""insert into product values(%s,%s,%s,%s)"""
val =[(1,"GTAV", "dfjjghghgjhkljlk", 2), (2, "TSHIRT", "JGJHJKLHJKH",5),(3, "ROG LAPTOP", "GHGFJHGJ", 4), (4, "OATS", "VHGGGGHHKJ", 3), (5, "HARRY POTTER", "VBNHJGHJGJ",1)]
cursor1.executemany(insert_prod_details,val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [31]:
connection.close()
connection = sqlcon.connect(host= "localhost", user = "root", passwd = "root123", database ="ecommerce")
cursor1= connection.cursor()
insert_ProdDetails_details= """insert into productdetails values(%s,%s,%s,%s)"""
val = [(1,1,2,1500), (2,3,5,30000), (3,5,1,3000), (4,2,3,2500), (5,4,1,1000)]
cursor1.executemany(insert_ProdDetails_details,val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [32]:
insert_orders_details= """insert into orders values(%s,%s,%s,%s,%s)"""
val = [(20, 1500, "2021-10-12", 3,5), (25, 30500, "2021-09-16",5,2), (26, 2000, "2021-10-05",1,1), (30,3500, "2021-08-16", 4,3), (50, 2000, "2021-10-06", 2,1)]
cursor1.executemany(insert_orders_details,val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [ ]:
insert_rating_details = """insert into rating values(%s,%s,%s,%s)"""
val = [(1,2,2,4),(2,3,4,3), (3,5,1,5), (4,1,3,2),(5,4,5,4)]
cursor1.executemany(insert_rating_details,val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [51]:
connection = sqlcon.connect(host= "localhost", user = "root", passwd = "root123", database ="ecommerce")
cursor1= connection.cursor()q= "select c.cus_gender as 'Gender', count(*) from customer c, orders o where c.cus_id = o.cus_id and o.ord_Amount>=3000 group by c.cus_gender"
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[('M', 1), ('F', 1)]

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [55]:
q= "select ord_id, pro_name, cus_name from orders o, customer c, productdetails pd, product p where o.cus_id = c.cus_id and o.prod_id = pd.prod_id and pd.pro_id = p.pro_id and c.cus_id =2"
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[(50, 'GTAV', 'AMAN')]

### Q5) Display the Supplier details who can supply more than one product.

In [59]:
q= "select s.* from supplier s where s.supp_id in (select supp_id from productdetails pd group by pd.supp_id having count(*)>1)"
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[(1, 'Rajesh Retails', 'Delhi', 1234567890)]

### Q6) Find the category of the product whose order amount is minimum.

In [60]:
q= "select cat_name from category c where cat_id = (Select cat_id from product where pro_id =(select pro_id from productdetails where prod_id = (select prod_id from orders where ord_amount =(select min(ord_amount) from orders))))"
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[('GROCERIES',)]

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [61]:
q= " select p.pro_id, p.pro_name from product p, productdetails pd, orders od where p.pro_id = pd.pro_id and pd.prod_id = od.prod_id and ord_date >'2021-10-05'  "
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[(4, 'OATS'), (1, 'GTAV')]

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [71]:
q= "SELECT  supp_name, s.supp_id, rat_ratstars, cus_name FROM rating r, supplier s,    customer c WHERE r.cus_id = c.cus_id AND s.supp_id = r.supp_id ORDER BY r.rat_ratstars DESC LIMIT 0 , 3"
cursor1.execute(q)
data = cursor1.fetchall()
for i in data:
    print(i)

[('Rajesh Retails', 1, 5.0, 'PULKIT'), ('Appario Ltd', 2, 4.0, 'AMAN'), ('Mittal Ltd.', 5, 4.0, 'MEGHA')]

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [63]:
q= "select cus_name, cus_gender from customer where cus_name like 'A%' or cus_name like '%A' "
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[('Aakash', 'M'), ('AMAN', 'M'), ('NEHA', 'F'), ('MEGHA', 'F')]

### Q10) Display the total order amount of the male customers.

In [65]:
q= "select sum(ord_amount) as 'Total Sum' from customer c, orders O where c.cus_gender= 'M' and c.cus_id = O.cus_id"
cursor1.execute(q)
data = cursor1.fetchall()
print(data)

[(Decimal('34500'),)]

### Q11) Display all the Customers left outer join with  the orders

In [69]:
q= "select * from customer c left join orders o on c.cus_id = o.cus_id "
cursor1.execute(q)
data = cursor1.fetchall()
for i in data:
    print(i)

(1, 'Aakash', 9999999999, 'DELHI', 'M', 26, 2000, datetime.date(2021, 10, 5), 1, 1)
(2, 'AMAN', 9785463215, 'NOIDA', 'M', 50, 2000, datetime.date(2021, 10, 6), 2, 1)
(3, 'NEHA', 99999999998, 'MUMBAI', 'F', 20, 1500, datetime.date(2021, 10, 12), 3, 5)
(4, 'MEGHA', 9994562399, 'KOLKATA', 'F', 30, 3500, datetime.date(2021, 8, 16), 4, 3)
(5, 'PULKIT', 7895999999, 'LUCKNOW', 'M', 25, 30500, datetime.date(2021, 9, 16), 5, 2)

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)